if OS.mac?
    # taps
    tap "homebrew/cask-fonts"
    tap "koekeishiya/formulae"
    tap "achannarasappa/tap"
      tap "homebrew/cask"
    brew "noti" # utility to display notifications from scripts

    # Applications
    cask "alacritty"
    cask "docker"

    # yabai
    brew "yabai"
    brew "skhd"

    # Fonts
    cask "font-jetbrains-mono-nerd-font"
elsif OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"

# packages
brew "bat" # cat with syntax highlighting
brew "direnv" # env variables based on $PWD
brew "duf" # disk usage/free utility
brew "eza" # ls alternative
brew "fd" # find alternative
brew "fish" # modern shell
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "git" # Git version control (latest version)
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "neovim", args: ["HEAD"] # A better vim
brew "node" # node (latest)
brew "pcalc" # programmer calculator
brew "python" # python (latest)
brew "ripgrep" # very fast file searcher
brew "rsync" # incremental file transfers
brew "shellcheck" # diagnostics for shell sripts
brew "starship" # cross-shell prompt
brew "stow" # link config files
brew "tldr" # simplified man pages
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "vim" # Vim (latest)
brew "wget" # internet file retriever
